import java.util.Scanner;
import java.util.Random;
import java.util.Hashtable;

//        System.out.println("★━━━━━━━━━━━━━━━━━━━━★");
//System.out.println("†*†*†*†*†*†*†*†*†*†*†*†*†*†*†*†*†*†*");
//System.out.println("(≧∪≦)ﾉ++++++++++++++++++++++++++++++++");
//System.out.println("(◇◆◇◆◇◆◇◆◇◆◇");
//・・・★・・・・・★・・・・・★・・・・・★・・・・・★・・・・・★
//+:-:+:-:+:-:+:-:+:-:+:-:+:-:+:-:+:-:+:-:+:-:+:-:+:-:+:-+:-
//～*～♡～*～♥～*～♡～*～♥～*～♡～*～♥～*～♡～*～
//★・・・・・・・★・・・・・・・・★・・・・・・・★・・・・・・・★・・・・・・・・★・・・・・・・★println
//♠,.:*:.,♠.,:*:,.♠,.:*:.,♠,.:*:.,♠,.:*:.,♠
//＋゜・☆＋゜・☆＋゜・☆＋゜・☆＋゜・☆
//☆:;;:★:;;:☆:;;:★:;;:☆:;;:★:;;:☆:;;:★:;;:☆:;;:★:;;:☆:;;:★:;;:
//┻━┻︵ \(°□°)/ ︵ ┻━┻
//ᕙ(⇀‸↼‶)ᕗ
//(╯°□°）╯︵ ┻━┻
//(ヘ･_･)ヘ┳━┳
//┏━┓ ︵ /(^.^/)
//(╥﹏╥)
//(っ◕‿◕)っ
//(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧
//(ง •̀_•́)ง
//ᕕ(⌐■_■)ᕗ ♪♬
//‿( ́ ̵ _-`)‿
//( •_•)>⌐■-■ (⌐■_■)
//@xxxx[{::::::::::::::>
//( _)0*´¯`·.¸.·´¯`°Q(_ )
//(///_ ;)
//(∩╹□╹∩)
//»»---------------►
//┬┴┬┴┤･ω･)ﾉ├┬┴┬┴
//(づ ￣ ³￣)づ
//(⌐■_■)--︻╦╤─ - - -
//( ͡° ͜ʖ ͡°)
//(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ. *
//ᕕ( ᐛ )ᕗ
//ಠ_ಠ
//ˁ(⦿ᴥ⦿)ˀ
//(-(-_(-_-)_-)-)
//█▬█ █ ▀█▀
//┣▇▇▇═─
//d[o_0]b
//( ^-^)_旦
//‹’’›(Ͼ˳Ͽ)‹’’›
//ʕノ•ᴥ•ʔノ ︵ ┻━┻
//ɯ-(ꞋʊꞋ)-ɯ   Kilroy
//( ^​_^）o自自o（^_​^ )
//ʕつ•ᴥ•ʔつ
//ʕつ ͡°ᴥ ͡°ʔつ
//ʕಠᴥಠʔ ಠ_ಠ ᶘಠᴥಠᶅ
//(ง’-‘)ง
//(/◕ヮ◕)/ (^o^) (✿◠‿◠)
//＼＼\٩(๑`^´๑)۶//／／
//ヽ༼ ʘ̚ل͜ʘ̚༼◕_◕༽◉_◔ ༽ﾉ
//٩(๏̯๏)۶
//↑_(ΦwΦ;)Ψ
//o(╥﹏╥)o
//Σ_(꒪ཀ꒪」∠)_
//༼ つ ▀_▀ ༽つ
//＼ ٩( ᐛ )و /／
///╲/\༼ *ಠ 益 ಠ* ༽/\╱\
//༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽
//༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽
//༼ つ ◕_◕ ༽つ
//(╯°□°）╯︵ ɥsɐpoן
//୧༼ಠ益ಠ༽୨
//༼つಠ益ಠ༽つ ─=≡ΣO))
//(　ﾟ Дﾟ)
//ヽ（´ー｀）┌
//(╯°□°)╯︵ ɹoɹɹƎ
//♪└(￣◇￣)┐♪





public class AdventureGame {
    public static void main(String[] args) {

        Scanner sc = new Scanner(System.in);
        System.out.println(" ______       ___    _ ,---.   .--.  .-_'''-.       .-''-.      ,-----.    ,---.   .--.        ,---------. .-------.        .-''-.  .--.   .--.   \n" +
                "|    _ `''. .'   |  | ||    \\  |  | '_( )_   \\    .'_ _   \\   .'  .-,  '.  |    \\  |  |        \\          \\|  _ _   \\     .'_ _   \\ |  | _/  /    \n" +
                "| _ | ) _  \\|   .'  | ||  ,  \\ |  ||(_ o _)|  '  / ( ` )   ' / ,-.|  \\ _ \\ |  ,  \\ |  |         `--.  ,---'| ( ' )  |    / ( ` )   '| (`' ) /     \n" +
                "|( ''_'  ) |.'  '_  | ||  |\\_ \\|  |. (_,_)/___| . (_ o _)  |;  \\  '_ /  | :|  |\\_ \\|  |            |   \\   |(_ o _) /   . (_ o _)  ||(_ ()_)      \n" +
                "| . (_) `. |'   ( \\.-.||  _( )_\\  ||  |  .-----.|  (_,_)___||  _`,/ \\ _/  ||  _( )_\\  |            :_ _:   | (_,_).' __ |  (_,_)___|| (_,_)   __  \n" +
                "|(_    ._) '' (`. _` /|| (_ o _)  |'  \\  '-   .''  \\   .---.: (  '\\_/ \\   ;| (_ o _)  |            (_I_)   |  |\\ \\  |  |'  \\   .---.|  |\\ \\  |  | \n" +
                "|  (_.\\.' / | (_ (_) _)|  (_,_)\\  | \\  `-'`   |  \\  `-'    / \\ `\"/  \\  ) / |  (_,_)\\  |           (_(=)_)  |  | \\ `'   / \\  `-'    /|  | \\ `'   / \n" +
                "|       .'   \\ /  . \\ /|  |    |  |  \\        /   \\       /   '. \\_/``\".'  |  |    |  |            (_I_)   |  |  \\    /   \\       / |  |  \\    /  \n" +
                "'-----'`      ``-'`-'' '--'    '--'   `'-...-'     `'-..-'      '-----'    '--'    '--'            '---'   ''-'   `'-'     `'-..-'  `--'   `'-' ");
        System.out.println("Hello, Hero! What is your name?");
        String name = sc.nextLine();

        System.out.printf("Hello, %s! Are you ready for your adventure?", name);
        String play = sc.next();
       if(play.equalsIgnoreCase("yes")){
           System.out.println("\n ̿' ̿'\\̵͇̿̿\\з=(◕_◕)=ε/̵͇̿̿/'̿'̿ ̿ " + "\n" +
               "   " +   "!!!LETS GO!!!\n");

           System.out.println("Choose Difficulty:");
           System.out.println("1 = Easy" + "\n" + "2 = Medium" + "\n" + "3 = Hard");

       }else if(play.equalsIgnoreCase("no")){
           System.out.println("                  ʕಠᴥಠʔ ಠ_ಠ ᶘಠᴥಠᶅʕಠᴥಠʔ ಠ_ಠ ᶘಠᴥಠᶅʕಠᴥಠʔ ಠ_ಠ ᶘಠᴥಠᶅ");
           System.out.println(" *・゜You・*:.。have*.。the.:*・moral☆・゜backbone・*:.。of.*.。.a.:*・chocolate☆・゜eclair・*:");
           System.exit(0);
       }

        String difficulty = sc.next();
        switch(difficulty) {

            case ("1"):
                System.out.println("＾･ꀾ･＾" + "\n" + "BEGIN!");
                break;

            case ("2"):
                System.out.println("ฅ^•ﻌ•^ฅ" + "/̵͇̿̿/'̿̿ ̿̿ ̿̿ " + "\n" + "BEGIN!");
                break;

            case ("3"):
                System.out.println("(⌐■_■)--︻╦╤─" + "\n" + "BEGIN!");
                break;
        }

    }
}
